louis-2020/Campanion-Pioneer-kit/campanion.cydsn/Generated_Source/PSoC6/ADC_4.h
    /* Clock parameters*/
    #if (ADC_4_CLOCK_INTERNAL)
        #define ADC_4_CFG3_CLOCKDIVIDER        (((CYDEV_CLK_PERICLK__HZ) / (ADC_4_CFG3_NOMINAL_CLOCK_FREQ)) - 1u)
    #endif /* (ADC_4_CLOCK_INTERNAL) */
#endif /* (ADC_4_TOTAL_CONFIGS > 3) */

/* ************************************************************************** */
/* End configuration 3 customizer defines                                     */
/* ************************************************************************** */

#define ADC_4_DEFAULT_SAMPLE_MODE_SEL      (0u)
#define ADC_4_FREERUNNING                  (1u)
#define ADC_4_HARDWARESOC                  (1u)
#define ADC_4_NEG_SEL_VSSA_KELVIN          (0x0uL)
#define ADC_4_NEG_SEL_VREF                 (0x7uL)
#define ADC_4_PWR_CTRL_VREF_NORMAL_PWR     (0x0uL)

/** ADC_4_TOTAL_CHANNELS_NUM
* This constant represents the number of input channels available for scanning.
*/
#define ADC_4_TOTAL_CHANNELS_NUM           (2u)

/*******************************************************************************
*    Variables with External Linkage
*******************************************************************************/
/**
* \addtogroup group_globals
* Globals are noted in the descriptions of the functions that use globals.
* They are marked with (R), (W), or (RW) noting whether the variable is read,
* write, or read/write.
* @{
*/

/** ADC_4_initVar
* The ADC_4_initVar variable is used to indicate
* initial configuration of this component. The variable is initialized to zero and
* set to 1 the first time ADC_4_Start() is called. This allows for
* component initialization without reinitialization in all subsequent calls to the
* ADC_4_Start() routine.
*
* If reinitialization of the component is required, then the ADC_4_Init() function
* can be called before the ADC_4_Start() or ADC_4_Enable()
* functions.
*/
extern uint8_t ADC_4_initVar;
extern uint8_t ADC_4_selected;
extern uint32_t ADC_4_currentConfig;

#define ADC_4_INIT_VAR_INIT_FLAG     (0x01u)

extern const ADC_4_CONFIG_STRUCT ADC_4_allConfigs[ADC_4_TOTAL_CONFIGS];

/* SysPm callback structure for deep sleep entry and exit.
 * Call the Cy_SysPm_RegisterCallback function with this
 * structure before calling Cy_SysPm_DeepSleep.
*/
extern cy_stc_syspm_callback_t ADC_4_DeepSleepCallbackStruct;

/** @} globals */

/* ************************************************************************** */
/* *******************Global MUX_SWITCH0 Definitions ************************ */
/* ************************************************************************** */
#if(ADC_4_CFG0_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN)
    /* Do not connect VSSA to VMINUS when one channel in differential mode used */
    #if((ADC_4_TOTAL_CHANNELS_NUM == 1u) && (ADC_4_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_4_MUX_SWITCH0_INIT      0u
    #else    /* multiple channels or one single ended channel */
        #define ADC_4_MUX_SWITCH0_INIT      1u
    #endif /* ((ADC_4_TOTAL_CHANNELS_NUM == 1u) && (ADC_4_CFG0_SINGLE_PRESENT == 0u)) */
#else
    #define ADC_4_MUX_SWITCH0_INIT          0u
#endif /* ADC_4_CFG0_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN */

/* ************************************************************************** */
/* Begin configuration 0 calculated defines                                   */
/* ************************************************************************** */
#define ADC_4_CFG0_SAMPLE_TIME01_INIT \
        ((ADC_4_CFG0_APERTURE_TIME0 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
        | (ADC_4_CFG0_APERTURE_TIME1 \
        << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

#define ADC_4_CFG0_SAMPLE_TIME23_INIT \
        ((ADC_4_CFG0_APERTURE_TIME2 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
        | (ADC_4_CFG0_APERTURE_TIME3 \
        << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

/* Enable soc pin if used */
#define ADC_4_CFG0_DSI_TRIGGER_EN_INIT \
        (ADC_4_CFG0_USE_SOC \
        << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

/* Set soc operation to edge or level based on sample mode */
#if(ADC_4_CFG0_FREERUNNING == ADC_4_FREERUNNING)
    #define ADC_4_CFG0_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
#else /* Edge trigger */
    #define ADC_4_CFG0_DSI_TRIGGER_LEVEL_INIT    (0u)
#endif /* End ADC_4_CFG0_FREERUNNING == ADC_4_FREERUNNING */

/* Set SE_NEG_INPUT */
#if(ADC_4_CFG0_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN)
    #define ADC_4_CFG0_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_4_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
#elif(ADC_4_CFG0_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VREF)

    /* Do not connect VNEG to VREF when one channel in differential mode used */
    /* Only needed for config 0 since 2+ configs == 2+ channels */
    #if((ADC_4_CFG0_CHANNEL_COUNT == 1u) && (ADC_4_CFG0_SINGLE_PRESENT == 0u))
        #define ADC_4_CFG0_SE_NEG_INPUT_INIT     0u
    #else    /* multiple channels or one single channel */
        #define ADC_4_CFG0_SE_NEG_INPUT_INIT     (ADC_4_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #endif /* (ADC_4_CFG0_CHANNEL_COUNT == 1u) && (ADC_4_CFG0_CHANNELS_MODE != 0u) */
#elif (ADC_4_CFG0_SINGLE_PRESENT != 0u)
    #define ADC_4_CFG0_SE_NEG_INPUT_INIT         ADC_4_CFG0_NEG_OTHER
#else
    #define ADC_4_CFG0_SE_NEG_INPUT_INIT         0u
#endif /* ADC_4_CFG0_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN */

#if(ADC_4_TOTAL_CHANNELS_NUM > 1u)
    #define ADC_4_CFG0_NEG_OTHER                 (uint16)((uint16)ADC_4_SARMUX__VNEG0 << SAR_CTRL_NEG_SEL_Pos)
    #define ADC_4_CFG0_SWITCH_CONF_INIT          0u
#else /* Disable SAR sequencer from enabling routing switches in single channel mode */
    #define ADC_4_CFG0_SWITCH_CONF_INIT          SAR_CTRL_SWITCH_DISABLE_Msk
    #define ADC_4_CFG0_NEG_OTHER                 0u
#endif /* ADC_4_CFG0_CHANNEL_COUNT > 1u */

/* If the SAR is configured for multiple channels, always set SAR_HW_CTRL_NEGVREF to 1 */
#if(ADC_4_TOTAL_CHANNELS_NUM == 1u)
    #define ADC_4_CFG0_HW_CTRL_NEGVREF_INIT      0u
#else
    #define ADC_4_CFG0_HW_CTRL_NEGVREF_INIT      SAR_CTRL_SAR_HW_CTRL_NEGVREF_Msk
#endif /* ADC_4_CFG0_CHANNEL_COUNT == 1u */

#define ADC_4_CFG0_POWER_INIT  (ADC_4_PWR_CTRL_VREF_NORMAL_PWR)

/* SAMPLE_CTRL initial values */
#define ADC_4_CFG0_SE_RESULT_FORMAT_INIT \
        (ADC_4_CFG0_SINGLE_ENDED_FORMAT \
        << SAR_SAMPLE_CTRL_SINGLE_ENDED_SIGNED_Pos)

#define ADC_4_CFG0_DIFF_RESULT_FORMAT_INIT \
        (ADC_4_CFG0_DIFFERENTIAL_FORMAT \
        << SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos)

#define ADC_4_CFG0_AVG_SAMPLES_NUM_INIT \
        (ADC_4_CFG0_SAMPLES_AVERAGED \
        << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

/* Combination of Average Mode and Average Shift */
#define ADC_4_CFG0_AVG_MODE_INIT \
        (ADC_4_CFG0_AVGERAGING_MODE \
        << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

#define ADC_4_CFG0_TRIGGER_OUT_INIT      (0u)
#define ADC_4_CFG0_UAB_SCAN_MODE_INIT    (0u)

#define ADC_4_CFG0_VREF_POWER_INIT  \
        (ADC_4_CFG0_VREF_PWR \
        << SAR_CTRL_PWR_CTRL_VREF_Pos)

#define ADC_4_CFG0_COMP_PWR_INIT  \
        (ADC_4_CFG0_COMP_PWR \
        << SAR_CTRL_COMP_PWR_Pos)

#define ADC_4_CFG0_COMP_DLY_INIT  \
        (ADC_4_CFG0_COMP_DLY \
        << SAR_CTRL_COMP_DLY_Pos)

#define ADC_4_CFG0_CTRL_INIT  \
        (ADC_4_CFG0_VREF_POWER_INIT \
        | ADC_4_CFG0_VREF_SEL_MASK \
        | ADC_4_CFG0_SE_NEG_INPUT_INIT \
        | ADC_4_CFG0_HW_CTRL_NEGVREF_INIT \
        | ADC_4_CFG0_COMP_DLY_INIT \
        | SAR_CTRL_REFBUF_EN_Msk \
        | ADC_4_CFG0_COMP_PWR_INIT \
        | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
        | ADC_4_CFG0_SWITCH_CONF_INIT )

#define ADC_4_CFG0_SAMPLE_CTRL_INIT \
        (ADC_4_CFG0_SE_RESULT_FORMAT_INIT \
        | ADC_4_CFG0_DIFF_RESULT_FORMAT_INIT \
        | ADC_4_CFG0_AVG_SAMPLES_NUM_INIT \
        | ADC_4_CFG0_AVG_MODE_INIT \
        | ADC_4_CFG0_DSI_TRIGGER_LEVEL_INIT \
        | ADC_4_CFG0_DSI_TRIGGER_EN_INIT \
        | ADC_4_CFG0_UAB_SCAN_MODE_INIT \
        | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
        | ADC_4_CFG0_TRIGGER_OUT_INIT \
        | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
)

#define ADC_4_CFG0_RANGE_THRES_INIT \
        (ADC_4_CFG0_LOW_LIMIT \
        | (uint32)((uint32)ADC_4_CFG0_HIGH_LIMIT \
        << SAR_RANGE_THRES_RANGE_HIGH_Pos))

#define ADC_4_CFG0_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)ADC_4_CFG0_RANGE_COND

/* Misc Config
    [0] - Freerunning: Set if the sample mode is freerunning
*/
#define ADC_4_CFG0_MISC_CONFIG_INIT \
        (ADC_4_CFG0_FREERUNNING)

/* ************************************************************************** */
/* End configuration 0 calculated defines                                     */
/* ************************************************************************** */

/* ************************************************************************** */
/* Begin configuration 1 calculated defines                                   */
/* ************************************************************************** */
#if(ADC_4_TOTAL_CONFIGS > 1)
    #define ADC_4_CFG1_SAMPLE_TIME01_INIT \
            ((ADC_4_CFG1_APERTURE_TIME0 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME0_Pos) \
            | (ADC_4_CFG1_APERTURE_TIME1 \
            << SAR_SAMPLE_TIME01_SAMPLE_TIME1_Pos))

    #define ADC_4_CFG1_SAMPLE_TIME23_INIT \
            ((ADC_4_CFG1_APERTURE_TIME2 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME2_Pos) \
            | (ADC_4_CFG1_APERTURE_TIME3 \
            << SAR_SAMPLE_TIME23_SAMPLE_TIME3_Pos))

    /* Enable soc pin if used */
    #define ADC_4_CFG1_DSI_TRIGGER_EN_INIT \
            (ADC_4_CFG1_USE_SOC \
            << SAR_SAMPLE_CTRL_DSI_TRIGGER_EN_Pos)

    /* Set soc operation to edge or level based on sample mode */
    #if(ADC_4_CFG1_FREERUNNING == ADC_4_FREERUNNING)
        #define ADC_4_CFG1_DSI_TRIGGER_LEVEL_INIT    (SAR_SAMPLE_CTRL_DSI_TRIGGER_LEVEL_Msk)
    #else /* Edge trigger */
        #define ADC_4_CFG1_DSI_TRIGGER_LEVEL_INIT    (0u)
    #endif /* End ADC_4_CFG1_FREERUNNING == ADC_4_FREERUNNING */

    /* Set SE_NEG_INPUT */
    #if(ADC_4_CFG1_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN)
        #define ADC_4_CFG1_SE_NEG_INPUT_INIT \
            ((uint32)(ADC_4_NEG_SEL_VSSA_KELVIN \
            << SAR_CTRL_NEG_SEL_Pos ))
    #elif(ADC_4_CFG1_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VREF)
        #define ADC_4_CFG1_SE_NEG_INPUT_INIT     (ADC_4_NEG_SEL_VREF \
                                                            << SAR_CTRL_NEG_SEL_Pos )
    #elif (ADC_4_CFG1_SINGLE_PRESENT != 0u)
        #define ADC_4_CFG1_SE_NEG_INPUT_INIT         ADC_4_CFG1_NEG_OTHER
    #else
        #define ADC_4_CFG1_SE_NEG_INPUT_INIT         0u
    #endif /* ADC_4_CFG1_VNEG_INPUT_SEL == ADC_4_NEG_SEL_VSSA_KELVIN */

