louis-2020/Campanion-Pioneer-kit/campanion.cydsn/Generated_Source/PSoC6/ADC_4.h
    #define ADC_4_CFG3_DIFF_RESULT_FORMAT_INIT \
            (ADC_4_CFG3_DIFFERENTIAL_FORMAT \
            << SAR_SAMPLE_CTRL_DIFFERENTIAL_SIGNED_Pos)

    #define ADC_4_CFG3_AVG_SAMPLES_NUM_INIT \
            (ADC_4_CFG3_SAMPLES_AVERAGED \
            << SAR_SAMPLE_CTRL_AVG_CNT_Pos)

    /* Combination of Average Mode and Average Shift */
    #define ADC_4_CFG3_AVG_MODE_INIT \
            (ADC_4_CFG3_AVGERAGING_MODE \
            << SAR_SAMPLE_CTRL_AVG_SHIFT_Pos)

    #define ADC_4_CFG3_TRIGGER_OUT_INIT      (0u)
    #define ADC_4_CFG3_UAB_SCAN_MODE_INIT    (0u)

    #define ADC_4_CFG3_VREF_POWER_INIT  \
            (ADC_4_CFG3_VREF_PWR \
            << SAR_CTRL_PWR_CTRL_VREF_Pos)

    #define ADC_4_CFG3_COMP_PWR_INIT  \
            (ADC_4_CFG3_COMP_PWR \
            << SAR_CTRL_COMP_PWR_Pos)

    #define ADC_4_CFG3_COMP_DLY_INIT  \
            (ADC_4_CFG3_COMP_DLY \
            << SAR_CTRL_COMP_DLY_Pos)

    #define ADC_4_CFG3_CTRL_INIT  \
            (ADC_4_CFG3_VREF_POWER_INIT \
            | ADC_4_CFG3_VREF_SEL_MASK \
            | ADC_4_CFG3_SE_NEG_INPUT_INIT \
            | ADC_4_CFG3_HW_CTRL_NEGVREF_INIT \
            | ADC_4_CFG3_COMP_DLY_INIT \
            | SAR_CTRL_REFBUF_EN_Msk \
            | ADC_4_CFG3_COMP_PWR_INIT \
            | SAR_CTRL_DSI_SYNC_CONFIG_Msk  \
            | ADC_4_CFG3_SWITCH_CONF_INIT )


    #define ADC_4_CFG3_SAMPLE_CTRL_INIT \
            (ADC_4_CFG3_SE_RESULT_FORMAT_INIT \
            | ADC_4_CFG3_DIFF_RESULT_FORMAT_INIT \
            | ADC_4_CFG3_AVG_SAMPLES_NUM_INIT \
            | ADC_4_CFG3_AVG_MODE_INIT \
            | ADC_4_CFG3_DSI_TRIGGER_LEVEL_INIT \
            | ADC_4_CFG3_DSI_TRIGGER_EN_INIT \
            | ADC_4_CFG3_UAB_SCAN_MODE_INIT \
            | SAR_SAMPLE_CTRL_VALID_IGNORE_Msk \
            | ADC_4_CFG3_TRIGGER_OUT_INIT \
            | SAR_SAMPLE_CTRL_EOS_DSI_OUT_EN_Msk \
    )

    #define ADC_4_CFG3_RANGE_THRES_INIT \
            (ADC_4_CFG3_LOW_LIMIT \
            | (uint32)((uint32)ADC_4_CFG3_HIGH_LIMIT \
            << SAR_RANGE_THRES_RANGE_HIGH_Pos))

    #define ADC_4_CFG3_RANGE_COND_INIT   (cy_en_sar_range_detect_condition_t)ADC_4_CFG3_RANGE_COND

    /* Misc Config
        [0] - Freerunning: Set if the sample mode is freerunning
    */
    #define ADC_4_CFG3_MISC_CONFIG_INIT \
            (ADC_4_CFG3_FREERUNNING )

#endif /* ADC_4_TOTAL_CONFIGS > 3 */

/* ************************************************************************** */
/* End configuration 3 calculated defines                                     */
/* ************************************************************************** */

/******************************************************************************
* Function Name: ADC_4_Enable
****************************************************************************//*
*
* \brief Enables the component.
*
* \param None
*
* \return None
*
* \sideeffect
*  None
*
*******************************************************************************/
__STATIC_INLINE void ADC_4_Enable(void)
{
    Cy_SAR_Enable(ADC_4_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_4_Stop
****************************************************************************//**
*
* \brief This function stops ADC conversions and puts the ADC into its lowest
* power mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Do not use the ADC_4_Stop() API to halt conversions. Instead use the
* ADC_4_StopConvert() API. If you use the ADC_4_Stop() API
* to halt conversions then later use the ADC_4_Start() and
* ADC_4_StartConvert() APIs to resume conversions, the first channel
* of the scan may be corrupt. The ADC_4_StopConvert() API will enable
* the ADC_4 to complete the current scan of channels. After the
* channel scan is complete, the ADC_4 will stop all conversions, which
* can be detected by the use of an ISR or the ADC_4_IsEndConversion()
* function.
*
*******************************************************************************/
__STATIC_INLINE void ADC_4_Stop(void)
{
    Cy_SAR_Disable(ADC_4_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_4_StopConvert
****************************************************************************//**
*
* \brief Forces the ADC_4 to stop conversions. If a conversion is
* currently executing, that conversion will complete, but no further conversions
* will occur.
*
* \param None
*
* \return None
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE void ADC_4_StopConvert(void)
{
    Cy_SAR_StopConvert(ADC_4_SAR__HW);
}

/*******************************************************************************
* Function Name: ADC_4_GetResult16
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register
*
* \param chan The ADC_4 channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 16-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_4_GetResult16(uint32_t chan)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_4_allConfigs[ADC_4_currentConfig].numChannels);

    return Cy_SAR_GetResult16(ADC_4_SAR__HW, chan);
}

/*******************************************************************************
* Function Name: ADC_4_GetResult32
****************************************************************************//**
*
* \brief Gets the data available in the channel result data register.
*
* \param chan The ADC_4 channel to read the result from. The first
* channel is 0.
*
* \return Returns converted data as a signed 32-bit integer.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t ADC_4_GetResult32(uint32_t chan)
{
    int32_t finalResult;

    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_4_allConfigs[ADC_4_currentConfig].numChannels);

    finalResult = Cy_SAR_GetResult32(ADC_4_SAR__HW, chan);

