louis-2020/Campanion-Pioneer-kit/campanion.cydsn/Generated_Source/PSoC6/ADC_4.h
    return Cy_SAR_CountsTo_Volts(ADC_4_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: ADC_4_CountsTo_mVolts
****************************************************************************//**
*
* \brief Converts the ADC output to millivolts as an int16. For example, if the ADC
* measured 0.534 volts, the return value would be 534.
* The calculation of voltage depends on the contents of Cy_SAR_offset[],
* Cy_SAR_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = Cy_SAR_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = Cy_SAR_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_4 channel number.
*
* \param adcCounts Result from the ADC_4 conversion.
*
* \return Result in mV.
*
* \sideeffect None.
*
*******************************************************************************/
__STATIC_INLINE int16_t ADC_4_CountsTo_mVolts(uint32_t chan, int16_t adcCounts)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_4_allConfigs[ADC_4_currentConfig].numChannels);

    return Cy_SAR_CountsTo_mVolts(ADC_4_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: ADC_4_CountsTo_uVolts
****************************************************************************//**
*
* \brief Converts the ADC output to microvolts as an int32. For example, if the ADC
* measured 0.534 volts, the return value would be 534000.
* The calculation of voltage depends on the contents of Cy_SAR_offset[],
* Cy_SAR_countsPer10Volt[], and other parameters.  The equation used is:
*
*     V = (Counts/AvgDivider - Offset)*TEN_VOLT/Gain
* -Counts = Raw Counts from SAR register
* -AvgDivider = divider based on averaging mode
*     -Sequential, Sum: AvgDivider = number averaged
*         Note: The divider should be a maximum of 16. If using more averages,
*         pre-scale Counts by (number averaged / 16)
*     -Interleaved, Sum: AvgDivider = number averaged
*     -Sequential, Fixed: AvgDivider = 1
* -Offset = Cy_SAR_offset[]
* -TEN_VOLT = 10V constant and unit scalar.
* -Gain = Cy_SAR_countsPer10Volt[]
*
* When the Vref is based on Vdda, the value used for Vdda is set for the project
* in the System tab of the DWR.
*
* \param chan ADC_4 channel number.
*
* \param adcCounts Result from the ADC_4 conversion.
*
* \return Result in microvolts.
*
* \sideeffect None
*
*******************************************************************************/
__STATIC_INLINE int32_t ADC_4_CountsTo_uVolts(uint32_t chan, int16_t adcCounts)
{
    /* Halt CPU in debug mode if channel is out of valid range */
    CY_ASSERT(chan < ADC_4_allConfigs[ADC_4_currentConfig].numChannels);

    return Cy_SAR_CountsTo_uVolts(ADC_4_SAR__HW, chan, adcCounts);
}

/*******************************************************************************
* Function Name: ADC_4_Sleep
****************************************************************************//**
*
* \brief This is the preferred routine to prepare the component for sleep. The
* ADC_4_Sleep() routine saves the current component state. Then it
* calls the ADC_4_Stop() function.
*
* Calling this routine directly is not needed.
* The ADC_4_DeepSleepCallbackStruct will ensure this routine
* is called before the device enters Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect If this function is called twice in the enable state of the
* component, the disabled state of the component will be stored. So
* ADC_4_Enable() and ADC_4_StartConvert() must be called
* after ADC_4_Wakeup() in this case.
*
* \globalvars
*  \ref ADC_4_backup (W)
*
* \globalvars
*  \ref ADC_4_backup
*
*******************************************************************************/
__STATIC_INLINE void ADC_4_Sleep(void)
{
    Cy_SAR_Sleep(ADC_4_SAR__HW);
}


/*******************************************************************************
* Function Name: ADC_4_Wakeup
****************************************************************************//**
*
* \brief This is the preferred routine to restore the component to the state when
* ADC_4_Sleep() was called.
* If the component was enabled before the ADC_4_Sleep()
* function was called, the ADC_4_Wakeup() function also re-enables the
* component.
*
* Calling this routine directly is not needed.
* The ADC_4_DeepSleepCallbackStruct will ensure this routine
* is called after the device wakes up from Deep Sleep mode.
*
* \param None
*
* \return None
*
* \sideeffect
* Calling this function without previously calling ADC_4_Sleep() may lead to
* unpredictable results.
*
* \globalvars
*  \ref ADC_4_backup (R)
*
* \globalvars
*  \ref ADC_4_backup
*
*******************************************************************************/
__STATIC_INLINE void ADC_4_Wakeup(void)
{
    Cy_SAR_Wakeup(ADC_4_SAR__HW);
}

#endif /* !defined(CY_ADC_4_H) */

/* [] END OF FILE */
